#Використовуйте модуль random для генерації випадкових чисел.
import random

#Щоб виграти головний приз лотереї, необхідний збіг кількох номерів на лотерейному квитку з числами, що випали випадковим чином і в певному діапазоні під час чергового тиражу. Наприклад, необхідно вгадати шість чисел від 1 до 49 чи п'ять чисел від 1 до 36 тощо.
#Вам необхідно написати функцію get_numbers_ticket(min, max, quantity), яка допоможе генерувати набір унікальних випадкових чисел для таких лотерей.
def get_numbers_ticket(min_num, max_num, quantity_num):
#Вона буде повертати випадковий набір чисел у межах заданих параметрів, причому всі випадкові числа в наборі повинні бути унікальні.
#min - мінімальне можливе число у наборі (не менше 1).
    if not (1 <= min_num < max_num <= 1000):
        return []
#max - максимальне можливе число у наборі (не більше 1000).
    if (quantity_num <=0 or quantity_num > (max_num - min_num +1)):
        return []
#quantity - кількість чисел, які потрібно вибрати (значення між min і max).
#Функція генерує вказану кількість унікальних чисел у заданому діапазоні.
    try:
        random_num = random.sample(range(min_num, max_num +1), quantity_num)
#Функція повертає список випадково вибраних, відсортованих чисел. Числа в наборі не повинні повторюватися. Якщо параметри не відповідають заданим обмеженням, функція повертає пустий список.
#Переконайтеся, що вхідні параметри відповідають заданим обмеженням.
        if len(set(random_num)) == len(random_num):
            return sorted(random_num)
    except ValueError:
        print("Your list is empty. Please enter valid numbers")
print(get_numbers_ticket(1,49,6))

