#У вашій компанії ведеться активна маркетингова кампанія за допомогою SMS-розсилок. Для цього ви збираєте телефонні номери клієнтів із бази даних, але часто стикаєтеся з тим, що номери записані у різних форматах. Наприклад:
#"    +38(050)123-32-34"
#"     0503451234"
#"(050)8889900"
#"38050-111-22-22"
#"38050 111 22 11   "
#Використовуйте модуль re для регулярних виразів для видалення непотрібних символів.
import re
#Ваш сервіс розсилок може ефективно відправляти повідомлення лише тоді, коли номери телефонів представлені у коректному форматі. Тому вам необхідна функція, яка автоматично нормалізує номери телефонів до потрібного формату, видаляючи всі зайві символи та додаючи міжнародний код країни, якщо потрібно.
#Розробіть функцію normalize_phone(phone_number), що нормалізує телефонні номери до стандартного формату, залишаючи тільки цифри та символ '+' на початку. Функція приймає один аргумент - рядок з телефонним номером у будь-якому форматі та перетворює його на стандартний формат, залишаючи тільки цифри та символ '+'. Якщо номер не містить міжнародного коду, функція автоматично додає код '+38' (для України). Це гарантує, що всі номери будуть придатними для відправлення SMS.

def normalize_phone(phone_number):
#Параметр функції phone_number - це рядок з телефонним номером у різноманітних форматах.
    try:
        #Функція видаляє всі символи, крім цифр та символу '+'.
        phone_number_cleaned = re.sub(r"[^\d]","",phone_number)
    #Якщо міжнародний код відсутній, функція додає код '+38'. Це враховує випадки, коли номер починається з '380' (додається лише '+') та коли номер починається без коду (додається '+38').
        if phone_number_cleaned.startswith("+380"):
            return phone_number_cleaned
        elif phone_number_cleaned.startswith("380"):
            return "+" + phone_number_cleaned
        elif phone_number_cleaned.startswith("0"):
            return "+38" + phone_number_cleaned
        else:
            return "+380"+ phone_number_cleaned
    except ValueError:
        print ("Invalid phone number detected")
#Функція повертає нормалізований телефонний номер у вигляді рядка.
raw_data = """
+38(050)123-32-34"
#"     0503451234"
#"(050)8889900"
#"38050-111-22-22"
#"38050 111 22 11   """
phone_numbers_test = [line.strip() for line in raw_data.splitlines() if line.strip()]
for num in phone_numbers_test:
    print(normalize_phone(num))

